# PartPhaseParametersConflictWithOriginal Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DPartFailures..::..PartPhaseParametersConflictWithOriginal Property
BuiltInFailures..::..DPartFailures Class See Also
---
The creation and demolition phases of a part must lie between the corresponding phases of the original.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PartPhaseParametersConflictWithOriginal { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PartPhaseParametersConflictWithOriginal As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PartPhaseParametersConflictWithOriginal {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DPartFailures Class
Autodesk.Revit.DB Namespace